Revit 2027 API
SizingOptions Methods
The SizingOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsValid |  Checks if the options are valid and ready for sizing operation.
SetEquivalentHeight |  Sets the equivalent height based on the specified width.
SetEquivalentWidth |  Sets the equivalent width based on the specified height.
SetNextAvailableSize(Double, ISet<MEPSize>) |  Sets the next available size based on the specified inner diameter.
SetNextAvailableSize(ConnectorProfileType, Double, Double, ISet<MEPSize>) |  Sets the next available size based on the specified inner diameter.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
SizingOptions Class
Autodesk.Revit.DB.Analysis Namespace